Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b7320fcb-d548-4601-9a7c-f8afd914b08c">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="64eb183a-1b76-4429-aa1b-57e4cc199142">
    <name>торо_ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2b394adb-1ebf-4922-857b-9874b3d4c03e">
    <name>торо_ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="35f75578-8d2f-4f0e-9148-b77abc4269db">
    <name>торо_ЗаявкаНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0fa16de-b6ee-4c56-8fb4-513c07684830">
    <name>торо_АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗавершитьРемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f78c6d7a-513d-4172-acd6-67cd539553be">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6ebc082-5b34-4dc9-989e-5ceca388a781">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="93edf17a-e6e1-43b7-b637-bb7683198138">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c026f7f3-9001-48e8-ae43-b6311afc572a">
      <name>Родитель_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="13c5222c-e72c-4deb-976b-ea5e71c2a76c">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5b155dad-268f-40a5-9cda-adf38b849861">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="292545f4-3656-4274-98e7-6524e7005040">
      <name>НоваяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e00ed1-d007-48a1-a97c-9c09cb1af366">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bce66135-2c2d-4b02-9b24-1b4b257fc415">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6e222db4-48e2-41e6-b0db-be541d07402b">
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="783b72be-3d92-47e1-83c1-f83e5d116bfb">
      <name>гкс_Давальческие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="305c47b2-824e-4796-a135-d4962b2f23d3">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/CommonForms/торо_ТекущиеЗадачиТОиР/Module.bsl
#Область ОбработчикиСобытийФормы
// гкс+ [разработка 2021] Куст 29.04.2021
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	#Вставка
	гкс_ДобавитьНовыеЭлементы();
	#КонецВставки

	ОткрыватьПриЗапуске = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбщаяФорма.торо_ТекущиеЗадачиТОиР", "ОткрыватьПриЗапуске", Истина);

	Если ОткрыватьПриЗапуске И (торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов("",Ложь) 
		ИЛИ торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов("", Истина)) Тогда 

		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация", Истина);
		ОбновитьЗадачи();
	Иначе 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
// гкс- [разработка 2021] Куст 29.04.2021
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ПроверитьВыборкуНаВозможностьДобавленияЗадач")
Функция гкс_ПроверитьВыборкуНаВозможностьДобавленияЗадач(Выборка)

	МассивВозвращаемый = Новый Массив;

	Если Выборка.Количество() > 0 Тогда
		ФОИспользоватьМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия");
		ФОИспользоватьВнешниеОснования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьВнешниеОснованияДляРабот");
		ФОИспользоватьДефекты = ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");
		ФОИспользоватьЗаявки = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСметыРемонта");
		ФОИспользоватьНаряды = ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаВыполнениеРабот");
		ФОИспользоватьПланГрафикРемонта = ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
		ФОИспользоватьОстановочныеРемонты = ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
		ФОИспользоватьАктПриемкиОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьАктПриемкиОборудования");

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот;
		мИспользоватьСогласованияДляАктаОВыполненииРабот = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот;
		мИспользоватьСогласованияДляВнешнихОснований = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты;
		мИспользоватьСогласованияДляДефектов = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт;
		мИспользоватьСогласованияДляЗаявок = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_НарядНаВыполнениеРемонтныхРабот;
		мИспользоватьСогласованияДляНарядовНаРемРаботы = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ПланГрафикРемонта;
		мИспользоватьСогласованияДляПланГрафикРемонта = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияМероприятий.торо_АктОВыполненииРегламентногоМероприятия;
		мИспользоватьСогласованияДляАктовОВыполненииМероприятий = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента, Истина);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияМероприятий.торо_ГрафикРегламентныхМероприятийТОиР;
		мИспользоватьСогласованияДляГрафиковМероприятий = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента, Истина);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияМероприятий.торо_НарядНаРегламентноеМероприятие;
		мИспользоватьСогласованияДляНарядовНаМероприятия = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента, Истина);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ОстановочныеРемонты;
		мИспользоватьСогласованияДляОстановочныхРемонтов = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктПриемкиОборудования;
		мИспользоватьСогласованияДляАктовПриемкиОборудования = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

		ПолучатьАктыОВыполненииЭтаповРабот = мИспользоватьСогласованияДляАктаОВыполненииРабот;
		ПолучатьАктыОВыполненииРегламентныхМероприятий = ФОИспользоватьМероприятия И мИспользоватьСогласованияДляАктовОВыполненииМероприятий;
		ПолучатьВнешниеОснованияДляРабот = ФОИспользоватьВнешниеОснования И мИспользоватьСогласованияДляВнешнихОснований;
		ПолучатьВыявленныеДефекты = ФОИспользоватьДефекты И мИспользоватьСогласованияДляДефектов;
		ПолучатьГрафикиРегламентныхМероприятий = ФОИспользоватьМероприятия И мИспользоватьСогласованияДляГрафиковМероприятий;
		ПолучатьЗаявкиНаРемонт = ФОИспользоватьЗаявки И мИспользоватьСогласованияДляЗаявок;
		ПолучатьНарядыНаВыполнениеРемонтныхРабот = ФОИспользоватьНаряды И мИспользоватьСогласованияДляНарядовНаРемРаботы;
		ПолучатьНарядыНаРегламентныеМероприятия = ФОИспользоватьМероприятия И мИспользоватьСогласованияДляНарядовНаМероприятия;
		ПолучатьПланыГрафикиРемонта = ФОИспользоватьПланГрафикРемонта и мИспользоватьСогласованияДляПланГрафикРемонта;
		ПолучатьОстановочныеРемонты = ФОИспользоватьОстановочныеРемонты и мИспользоватьСогласованияДляОстановочныхРемонтов;
		ПолучатьАктыПриемкиОборудования = ФОИспользоватьАктПриемкиОборудования и мИспользоватьСогласованияДляАктовПриемкиОборудования;

		Пока Выборка.Следующий() Цикл

			Документ = Выборка.Документ;
			#Вставка
			СтруктураВыборки = Новый Структура("Ссылка,Просрочен,Сообщение", Выборка.Документ, Выборка.Просрочен, Выборка.Сообщение);
			#КонецВставки

			// Проверка РЛС
			Если СтрНайти(Строка(Документ), НСтр("es='El objeto no es encontrado';ru='Объект не найден';en='Object not found'")) > 0 Тогда
				Продолжить;	
			КонецЕсли;

			#Удаление
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") 
				И ПолучатьАктыОВыполненииЭтаповРабот Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")
				И ПолучатьАктыОВыполненииРегламентныхМероприятий Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот")
				И ПолучатьВнешниеОснованияДляРабот Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
				И ПолучатьВыявленныеДефекты Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") 
				И ПолучатьГрафикиРегламентныхМероприятий Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
				И ПолучатьЗаявкиНаРемонт Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")
				И ПолучатьНарядыНаВыполнениеРемонтныхРабот Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") 
				И ПолучатьНарядыНаРегламентныеМероприятия Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") 
				И ПолучатьПланыГрафикиРемонта Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") 
				И ПолучатьОстановочныеРемонты Тогда
				МассивВозвращаемый.Добавить(Документ);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктПриемкиОборудования") 
				И ПолучатьАктыПриемкиОборудования Тогда
				МассивВозвращаемый.Добавить(Документ);
			КонецЕсли;
			#КонецУдаления
			#Вставка
			// гкс+ [разработка 2021] Куст 29.04.2021
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") 
				И ПолучатьАктыОВыполненииЭтаповРабот Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")
				И ПолучатьАктыОВыполненииРегламентныхМероприятий Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот")
				И ПолучатьВнешниеОснованияДляРабот Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
				И ПолучатьВыявленныеДефекты Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") 
				И ПолучатьГрафикиРегламентныхМероприятий Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
				И ПолучатьЗаявкиНаРемонт Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")
				И ПолучатьНарядыНаВыполнениеРемонтныхРабот Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") 
				И ПолучатьНарядыНаРегламентныеМероприятия Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") 
				И ПолучатьПланыГрафикиРемонта Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") 
				И ПолучатьОстановочныеРемонты Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.гкс_ЕВОБланк")  Тогда 
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктПриемкиОборудования") 
				И ПолучатьАктыПриемкиОборудования Тогда
				МассивВозвращаемый.Добавить(СтруктураВыборки);
			КонецЕсли;
			// гкс- [разработка 2021] Куст 29.04.2021
			#КонецВставки

		КонецЦикла;
	КонецЕсли;

	Возврат МассивВозвращаемый;

КонецФункции

// гкс+ [разработка 2021] Куст 29.04.2021
&НаСервере
&ИзменениеИКонтроль("ОбновитьЗадачи")
Процедура гкс_ОбновитьЗадачи()

	ТаблицаСОтображаемымиДокументами = Новый ТаблицаЗначений;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.СогласуемыйДокумент КАК Документ,
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Порядок КАК Порядок,
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Статус КАК Статус,
	#Удаление
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.СогласуемыйДокумент.СпособСогласования КАК ДокументСпособСогласования,
	#КонецУдаления
	#Вставка
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.СпособСогласования КАК ДокументСпособСогласования,
	#КонецВставки
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.НеНапоминать КАК НеНапоминать,
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ДокументыСоСпособамиСогласования
	|ИЗ
	|	РегистрСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот КАК торо_СтатусыСогласованияДокументовРемонтныхРабот
	|ГДЕ
	|	(торо_СтатусыСогласованияДокументовРемонтныхРабот.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	#Вставка
	|	И торо_СтатусыСогласованияДокументовРемонтныхРабот.Пользователь = &Пользователь
	|	И НЕ торо_СтатусыСогласованияДокументовРемонтныхРабот.НеНапоминать
	|	И &УсловиеОтбораПоПодразделению
	#КонецВставки
	|	И торо_СтатусыСогласованияДокументовРемонтныхРабот.Дата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	#Вставка
	| " + "	
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументСпособСогласования,
	|	Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_МатрицаПереходаСтатусовДокументов.СпособСогласования КАК СпособСогласования,
	|	торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус КАК ТекущийСтатус,
	|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК СледующийСтатус,
	|	торо_НастройкиСтатусовСогласованияДокументов.НеОтображатьВСпискеЗадач КАК НеОтображатьВСпискеЗадач
	|ПОМЕСТИТЬ ВТ_ОтображаемыеСтатусы
	|ИЗ
	|	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	|		ПО торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования
	|			И торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус = торо_НастройкиСтатусовСогласованияДокументов.Статус
	|ГДЕ
	|	(торо_МатрицаПереходаСтатусовДокументов.СпособСогласования, торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус) В
	|			(ВЫБРАТЬ
	|				ДокументыСоСпособамиСогласования.ДокументСпособСогласования,
	|				ДокументыСоСпособамиСогласования.Статус
	|			ИЗ
	|				ДокументыСоСпособамиСогласования КАК ДокументыСоСпособамиСогласования)
	|	И торо_НастройкиСтатусовСогласованияДокументов.НеОтображатьВСпискеЗадач = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособСогласования,
	|	ТекущийСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыСоСпособамиСогласования.Документ КАК Документ,
	|	ДокументыСоСпособамиСогласования.Порядок КАК Порядок,
	|	ДокументыСоСпособамиСогласования.Статус КАК Статус,
	|	ДокументыСоСпособамиСогласования.ДокументСпособСогласования КАК ДокументСпособСогласования,
	|	ДокументыСоСпособамиСогласования.НеНапоминать КАК НеНапоминать,
	|	ДокументыСоСпособамиСогласования.Пользователь КАК Пользователь
	#Вставка
	|	,НЕ РегистрСведенийгкс_ОтправленныеУведомленияОСроках.Документ есть NULL КАК Просрочен
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_ОтобранныеЗаписи
	|ИЗ
	|	ДокументыСоСпособамиСогласования КАК ДокументыСоСпособамиСогласования
	#Вставка
	|	Левое соединение РегистрСведений.гкс_ОтправленныеУведомленияОСроках КАК РегистрСведенийгкс_ОтправленныеУведомленияОСроках
	|	ПО РегистрСведенийгкс_ОтправленныеУведомленияОСроках.Документ = ДокументыСоСпособамиСогласования.Документ
	|	И РегистрСведенийгкс_ОтправленныеУведомленияОСроках.Способ = ДокументыСоСпособамиСогласования.ДокументСпособСогласования
	|	И РегистрСведенийгкс_ОтправленныеУведомленияОСроках.Статус = ДокументыСоСпособамиСогласования.Статус
	|	И РегистрСведенийгкс_ОтправленныеУведомленияОСроках.Событие = ""Просрочен""
	#КонецВставки
	|ГДЕ
	|	(ДокументыСоСпособамиСогласования.ДокументСпособСогласования, ДокументыСоСпособамиСогласования.Статус) В
	|			(ВЫБРАТЬ
	|				ВТ_ОтображаемыеСтатусы.СпособСогласования КАК СпособСогласования,
	|				ВТ_ОтображаемыеСтатусы.ТекущийСтатус КАК ТекущийСтатус
	|			ИЗ
	|				ВТ_ОтображаемыеСтатусы КАК ВТ_ОтображаемыеСтатусы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Порядок
	|;
	#Вставка
	|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РемонтыСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Отмененные
		|ИЗ
		|	РегистрСведений.торо_Ремонты.СрезПоследних(
		|			,
		|			Регистратор В
		|				(ВЫБРАТЬ
		|					ТЧ.Документ
		|				ИЗ
		|					ВТ_ОтобранныеЗаписи КАК ТЧ)) КАК торо_РемонтыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
		|		ПО (торо_РемонтыСрезПоследних.ID = торо_ОтмененныеРемонтыСрезПоследних.ID
		|				И торо_ОтмененныеРемонтыСрезПоследних.Отменен = ИСТИНА)
		|;
	#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Документ КАК Документ,
	|	МИНИМУМ(торо_СтатусыСогласованияДокументовРемонтныхРабот.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ТекущийПорядок
	|ИЗ
	|	ВТ_ОтобранныеЗаписи КАК торо_СтатусыСогласованияДокументовРемонтныхРабот
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Отмененные КАК Отмененные
	|		ПО торо_СтатусыСогласованияДокументовРемонтныхРабот.Документ = Отмененные.Регистратор
	|ГДЕ
	|	Отмененные.Регистратор ЕСТЬ NULL
	#КонецВставки
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Документ КАК Документ
	#Вставка
	|	,торо_СтатусыСогласованияДокументовРемонтныхРабот.Просрочен КАК Просрочен
	|Поместить ВТ_Результат
	#КонецВставки
	|ИЗ
	|	ТекущийПорядок КАК ТекущийПорядок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтобранныеЗаписи КАК торо_СтатусыСогласованияДокументовРемонтныхРабот
	|		ПО ТекущийПорядок.Документ = торо_СтатусыСогласованияДокументовРемонтныхРабот.Документ
	|			И ТекущийПорядок.Порядок = торо_СтатусыСогласованияДокументовРемонтныхРабот.Порядок
	#Удаление
	|ГДЕ
	|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Пользователь = &Пользователь
	|	И НЕ торо_СтатусыСогласованияДокументовРемонтныхРабот.НеНапоминать";	
	#КонецУдаления
	#Вставка
	|";
	//Думаю, что по подразделению должно быть условие "В ИЕРАРХИИ", но оставил как было, чтобы не нарушать логику ранее
	УсловиеПоПодразделению = "ИСТИНА";
	
	Если ЗначениеЗаполнено(ЭтотОбъект["ОтборПодразделение"]) Тогда
		УсловиеПоПодразделению = "торо_СтатусыСогласованияДокументовРемонтныхРабот.Подразделение = &Подразделение";		
	КонецЕсли;
	      
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоПодразделению", УсловиеПоПодразделению);      	
	#КонецВставки

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	#Вставка
	#Область ТекстЗапроса_ТЧОРиОписание
	Запрос.Текст = Запрос.Текст + " ; " 
	+ "ВЫБРАТЬ
	  |	ВТ_Результат.Документ КАК Документ,
	  |	ВТ_Результат.Просрочен КАК Просрочен,
	  |	""Согласовать документ "" КАК Сообщение
	  |ИЗ
	  |	ВТ_Результат КАК ВТ_Результат
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{ 
	  |
	  |ОБЪЕДИНИТЬ ВСЕ 
	  |
	  |ВЫБРАТЬ
	  |	ОжидаемыеМероприятияЕвобланк.Регистратор,
	  |	ВЫБОР
	  |		КОГДА МероприятияПоПредупреждениюСсылка.Срок < &ТекущаяДата
	  |			ТОГДА ИСТИНА
	  |		ИНАЧЕ ЛОЖЬ
	  |	КОНЕЦ,
	  |	""Выполнить мероприятие ""
	  |ИЗ
	  |	РегистрСведений.гкс_ОжидаемыеМероприятияЕвобланк КАК ОжидаемыеМероприятияЕвобланк
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЕВОБланк.МероприятияПоПредупреждению КАК МероприятияПоПредупреждениюСсылка
	  |		ПО (ОжидаемыеМероприятияЕвобланк.Регистратор = МероприятияПоПредупреждениюСсылка.Ссылка)
	  |			И (ОжидаемыеМероприятияЕвобланк.Мероприятие = МероприятияПоПредупреждениюСсылка.Мероприятие)
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЕВОБланк КАК ЕВОБланкСсылка
	  |		ПО (ЕВОБланкСсылка.Ссылка = ОжидаемыеМероприятияЕвобланк.Регистратор)
	  |ГДЕ
	  |	ОжидаемыеМероприятияЕвобланк.Ответственный = &Пользователь
	  |	И (ЕВОБланкСсылка.Организация = &Организация
	  |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	  |	И (ЕВОБланкСсылка.Подразделение = &Подразделение
	  |			ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ОжидаемыеМероприятияЕвобланк.Регистратор,
	  |	ВЫБОР
	  |		КОГДА МероприятияПоПредупреждениюСсылка.Срок < &ТекущаяДата
	  |			ТОГДА ИСТИНА
	  |		ИНАЧЕ ЛОЖЬ
	  |	КОНЕЦ
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  // Гкс+[TOIR20-565] Зозуля А.В. от 29.04.2025. Изменено:{
	  //|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
	  //На:
	  |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОбъектРемонта,
	  // } Гкс-[TOIR20-565] Зозуля А.В. от 29.04.2025.
	  |	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	  |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК Описание
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |	, торо_ВыявленныеДефектыСсылка.Дата КАК Дата
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |ИЗ
	  |	ВТ_Результат КАК ВТ_Результат
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	  |		ПО (торо_ВыявленныеДефектыСписокДефектов.Ссылка = ВТ_Результат.Документ)
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефектыСсылка
	  |		ПО (торо_ВыявленныеДефектыСсылка.Ссылка = ВТ_Результат.Документ)
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта,
	  |	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
	  |	торо_ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |	, торо_ЗаявкаНаРемонтСсылка.Дата
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |ИЗ
	  |	ВТ_Результат КАК ВТ_Результат
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	  |		ПО (торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = ВТ_Результат.Документ)
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонтСсылка
	  |		ПО (торо_ЗаявкаНаРемонтСсылка.Ссылка = ВТ_Результат.Документ)
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта,
	  |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка,
	  |	""""
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{ 
	  |	, торо_АктОВыполненииЭтапаРаботСсылка.Дата
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |ИЗ
	  |	ВТ_Результат КАК ВТ_Результат
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	  |		ПО (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = ВТ_Результат.Документ)
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{ 
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРаботСсылка
	  |		ПО (торо_АктОВыполненииЭтапаРаботСсылка.Ссылка = ВТ_Результат.Документ)
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта,
	  |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка,
	  |	""""
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |	, торо_НарядНаВыполнениеРемонтныхРаботСсылка.Дата
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |ИЗ
	  |	ВТ_Результат КАК ВТ_Результат
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	  |		ПО (торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка = ВТ_Результат.Документ)
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРаботСсылка
	  |		ПО (торо_НарядНаВыполнениеРемонтныхРаботСсылка.Ссылка = ВТ_Результат.Документ)
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |
	  |ОБЪЕДИНИТЬ ВСЕ 
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |
	  |ВЫБРАТЬ
	  // Гкс+[TOIR20-565] Зозуля А.В. от 29.04.2025. Изменено:{
	  //|	ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
	  //На:
	  |	ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
	  // } Гкс-[TOIR20-565] Зозуля А.В. от 29.04.2025.
	  |	ОжидаемыеМероприятияЕвобланк.Регистратор,
	  |	ОжидаемыеМероприятияЕвобланк.Мероприятие,
	  | МероприятияПоПредупреждениюСсылка.Срок
	  |ИЗ
	  |	РегистрСведений.гкс_ОжидаемыеМероприятияЕвобланк КАК ОжидаемыеМероприятияЕвобланк
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЕВОБланк КАК ЕВОБланк
	  |		ПО (ЕВОБланк.Ссылка = ОжидаемыеМероприятияЕвобланк.Регистратор)
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЕВОБланк.МероприятияПоПредупреждению КАК МероприятияПоПредупреждениюСсылка
	  |		ПО (ОжидаемыеМероприятияЕвобланк.Регистратор = МероприятияПоПредупреждениюСсылка.Ссылка)
	  |			И (ОжидаемыеМероприятияЕвобланк.Мероприятие = МероприятияПоПредупреждениюСсылка.Мероприятие)
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК ВыявленныеДефектыСписокДефектов
	  |		ПО (ЕВОБланк.ДокументОснование = ВыявленныеДефектыСписокДефектов.Ссылка )
	  |ГДЕ
	  |	ОжидаемыеМероприятияЕвобланк.Ответственный = &Пользователь
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |
	  |ВЫБРАТЬ
	  |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта,
	  |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка,
	  |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Описание
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |	, торо_ВнешнееОснованиеДляРаботСсылка.Дата
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |ИЗ
	  |	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{ 
	  |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРаботСсылка
	  | ПО торо_ВнешнееОснованиеДляРаботСсылка.Ссылка = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |ИТОГИ ПО
	  |	Ссылка
	  // Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено:{
	  |, Дата
	  // } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
	  |";
	#КонецОбласти
	Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект["ОтборПодразделение"]); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.ВыполнитьПакет();
	НомерПакетаОсновной = 6;
	НомерПакетаОР = 7;
	Выборка = Результат[НомерПакетаОсновной].Выбрать();
	ВыборкаОР = Результат[НомерПакетаОР].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	#КонецВставки

	#Удаление
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	#КонецУдаления

	ТекущиеЗадачиСписок.Очистить();

	МассивДобавляемых = ПроверитьВыборкуНаВозможностьДобавленияЗадач(Выборка);

	Для Каждого Документ Из МассивДобавляемых Цикл
		
		#Удаление 
		НоваяЗадача = ТекущиеЗадачиСписок.Добавить();
		НоваяЗадача.ТекстСписка	= "Согласовать документ " + Документ;
		НоваяЗадача.Ссылка = Документ;
		#КонецУдаления
		#Вставка
		// Гкс+[TOIR20-556] Вялых Д.А. от 12.03.2025. Добавлено и закомментировано:{
		//НоваяЗадача = ТекущиеЗадачиСписок.Добавить();
		//НоваяЗадача.ТекстСписка	= "Согласовать документ " + Документ.Ссылка;
		//НоваяЗадача.Ссылка = Документ.Ссылка; 
		//НоваяЗадача.ДатаДокумента = Документ.Ссылка.Дата; 
		//НоваяЗадача.Просрочен = Документ.Просрочен;
		//СтруктПоиска = Новый Структура("Ссылка", Документ.Ссылка);
		//ВыборкаОР.Сбросить();
		//Если ВыборкаОР.НайтиСледующий(СтруктПоиска) Тогда			
		//	МассивОР = Новый Массив();
		//	МассивТекста = Новый Массив();
		//	
		//	ВыборкаСтрока = ВыборкаОР.Выбрать();
		//	
		//	Пока ВыборкаСтрока.Следующий() Цикл
		//		Если МассивОР.Найти(ВыборкаСтрока.ОбъектРемонта) = Неопределено Тогда
		//			МассивОР.Добавить(ВыборкаСтрока.ОбъектРемонта);
		//		КонецЕсли;
		//		Если ЗначениеЗаполнено(ВыборкаСтрока.Описание) Тогда 
		//			МассивТекста.Добавить(ВыборкаСтрока.Описание);
		//		КонецЕсли;
		//	КонецЦикла; 
		//	НоваяЗадача.НаименованиеОР = СтрСоединить(МассивОР, ", ");
		//	НоваяЗадача.ОписаниеДефекта = СтрСоединить(МассивТекста, "; ");
		//	
		//КонецЕсли; 		
		
		СтруктПоиска = Новый Структура("Ссылка", Документ.Ссылка);
		ВыборкаОР.Сбросить();
		Если ВыборкаОР.НайтиСледующий(СтруктПоиска) Тогда			
			
			ВыборкаДата = ВыборкаОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаДата.Следующий() Цикл
				
				НоваяЗадача = ТекущиеЗадачиСписок.Добавить();
				
				НоваяЗадача.ТекстСписка	= Документ.Сообщение + Документ.Ссылка;
				
				НоваяЗадача.Ссылка = Документ.Ссылка;
				НоваяЗадача.Просрочен = Документ.Просрочен;
				НоваяЗадача.ДатаДокумента = ВыборкаДата.Дата;
				
				МассивОР = Новый Массив();
				МассивТекста = Новый Массив();
				
				ВыборкаСтрока = ВыборкаДата.Выбрать();
				
				Пока ВыборкаСтрока.Следующий() Цикл
					Если МассивОР.Найти(ВыборкаСтрока.ОбъектРемонта) = Неопределено Тогда
						МассивОР.Добавить(ВыборкаСтрока.ОбъектРемонта);
					КонецЕсли;
					// Гкс+[TOIR20-565] Зозуля А.В. от 29.04.2025. Изменено:{
					//Если ЗначениеЗаполнено(ВыборкаСтрока.Описание) Тогда
					///На:
					Если ЗначениеЗаполнено(ВыборкаСтрока.Описание) И МассивТекста.Найти(ВыборкаСтрока.Описание) = Неопределено Тогда
					// } Гкс-[TOIR20-565] Зозуля А.В. от 29.04.2025.	
						МассивТекста.Добавить(ВыборкаСтрока.Описание);
					КонецЕсли;
				КонецЦикла; 
				НоваяЗадача.НаименованиеОР = СтрСоединить(МассивОР, ", ");
				
				НоваяЗадача.ОписаниеДефекта = СтрСоединить(МассивТекста, "; ");
				
				Если СокрЛП(Документ.Сообщение) = "Согласовать документ" 
					И ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.гкс_ЕВОБланк") Тогда	
					НоваяЗадача.ОписаниеДефекта = "";	
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			
			НоваяЗадача = ТекущиеЗадачиСписок.Добавить();
			
			НоваяЗадача.ТекстСписка	= Документ.Сообщение + Документ.Ссылка;
			НоваяЗадача.Ссылка = Документ.Ссылка; 
			НоваяЗадача.ДатаДокумента = Документ.Ссылка.Дата; 
			НоваяЗадача.Просрочен = Документ.Просрочен;
				
		КонецЕсли;
		// } Гкс-[TOIR20-556] Вялых Д.А. от 12.03.2025.
		#КонецВставки

	КонецЦикла;

	Элементы.ТекущиеЗадачиСписок.Обновить();
	#Вставка
	гкс_СортироватьТаблицу();
	#КонецВставки

КонецПроцедуры // гкс- [разработка 2021] Куст 29.04.2021

// гкс+ [разработка 2021] Куст 29.04.2021
&НаСервере
Процедура гкс_ДобавитьНовыеЭлементы()
	МассРеквизитов = Новый Массив();
	МассРеквизитов.Добавить(Новый РеквизитФормы("Просрочен", Новый ОписаниеТипов("Булево"), "ТекущиеЗадачиСписок"));
	// гкс+ [Релиз16] Деснол
	МассРеквизитов.Добавить(Новый РеквизитФормы("ОтборПодразделение",
		Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия")));
	// гкс- [Релиз16]
	// гкс+ [Релиз18] Деснол
	ТипСтрока500 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(500));
	МассРеквизитов.Добавить(Новый РеквизитФормы("НаименованиеОР", ТипСтрока500, "ТекущиеЗадачиСписок"));
	МассРеквизитов.Добавить(Новый РеквизитФормы("ОписаниеДефекта", ТипСтрока500, "ТекущиеЗадачиСписок"));
	// гкс- [Релиз18]
	ИзменитьРеквизиты(МассРеквизитов);
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("ТекущиеЗадачиСписок");

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТекущиеЗадачиСписок.Просрочен");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
	//
	// гкс+ [Релиз16] Деснол
	НовыйЭлемент = Элементы.Вставить("ОтборПодразделениеКнопка", Тип("ПолеФормы"), Элементы.ОрганизацияИКомандаОбновить, Элементы.Обновить);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОтборПодразделение";
	НовыйЭлемент.Заголовок = НСтр("es='La subdivisión';ru='Подразделение';en='Subdivision'");
	// гкс- [Релиз16]
	// гкс+ [Релиз18] Деснол
	НовыйЭлемент = Элементы.Добавить("Список_НаименованиеОР", Тип("ПолеФормы"), Элементы.ТекущиеЗадачиСписок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТекущиеЗадачиСписок.НаименованиеОР";
	НовыйЭлемент.Заголовок = НСтр("es='El objeto de la reparación';ru='Объект ремонта';en='Object of repair'");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	//
	НовыйЭлемент = Элементы.Добавить("Список_ОписаниеДефекта", Тип("ПолеФормы"), Элементы.ТекущиеЗадачиСписок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТекущиеЗадачиСписок.ОписаниеДефекта";
	НовыйЭлемент.Заголовок = НСтр("es='El defecto la descripción';ru='Описание дефекта';en='Defect description'");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [Релиз18]
	// Сотртировка по дате
	Элементы.ТекущиеЗадачиСписок.ИзменятьПорядокСтрок = Истина;
	МассРекв = Новый Массив();
	МассРекв.Добавить(Новый РеквизитФормы("гкс_СортПоДате", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(15))));
	МассРекв.Добавить(Новый РеквизитФормы("ДатаДокумента", Новый ОписаниеТипов("Дата"), "ТекущиеЗадачиСписок"));
	ИзменитьРеквизиты(МассРекв);
	НовыйЭлемент = Элементы.Добавить("Сорт_ПоДате", Тип("ПолеФормы"), Элементы.ОрганизацияИКомандаОбновить);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_СортПоДате";
	НовыйЭлемент.Заголовок = НСтр("ru='Сортировка по дате'");
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Добавить(" ", "Нет");
	НовыйЭлемент.СписокВыбора.Добавить("Возр.", "Возр.");
	НовыйЭлемент.СписокВыбора.Добавить("Убыв.", "Убыв.");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_СортПоДатеПриИзменении");
	//
	НовыйЭлемент = Элементы.Добавить("Список_ДатаДокумента", Тип("ПолеФормы"), Элементы.ТекущиеЗадачиСписок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТекущиеЗадачиСписок.ДатаДокумента";
	НовыйЭлемент.Заголовок = НСтр("es='Date';ru='Дата';en='Date'");
	НовыйЭлемент.ТолькоПросмотр = Истина;

КонецПроцедуры // гкс- [разработка 2021] Куст 29.04.2021

&НаКлиенте
Процедура гкс_СортПоДатеПриИзменении(Элемент)
	Если Не ЭтотОбъект["гкс_СортПоДате"] = " " Тогда 
		гкс_СортироватьТаблицу();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура гкс_СортироватьТаблицу()
	Если Не ЭтотОбъект["гкс_СортПоДате"] = " " Тогда 
		ТекущиеЗадачиСписок.Сортировать("ДатаДокумента " + ?(ЭтотОбъект["гкс_СортПоДате"] = "Убыв.", "Убыв", "Возр"));
	КонецЕсли;
КонецПроцедуры
 
#КонецОбласти
